app/Models/CatModel.php

	public function getAllCats(){
		$db = db_connect();
		$builder = $db->table('category');
		$builder->select('*');
		$records = $builder->get();
---
SELECT *
FROM `category`