app/Models/ReportModel.php

    public function analyse_income(){
		$db = db_connect();
		$builder = $db->table("transaction");
		$builder->select("*");
		$builder->join("category","transaction.trcategory = category.catid");
		$builder->where("transaction.deleted_at",null);
		$builder->where("category.cattype",1);
		$builder->orderBy("transaction.trdate","ASC");
		$records = $builder->get();
---
SELECT *
FROM `transaction`
JOIN `category` ON `transaction`.`trcategory` = `category`.`catid`
WHERE `transaction`.`deleted_at` IS NULL
AND `category`.`cattype` = 1
ORDER BY `transaction`.`trdate` ASC

	public function analyse_expense(){
		$db = db_connect();
		$builder = $db->table("transaction");
		$builder->select("*");
		$builder->join("category","transaction.trcategory = category.catid");
		$builder->where("transaction.deleted_at",null);
		$builder->where("category.cattype",2);
		$builder->orderBy("transaction.trdate","ASC");
		$records = $builder->get();
---
SELECT *
FROM `transaction`
JOIN `category` ON `transaction`.`trcategory` = `category`.`catid`
WHERE `transaction`.`deleted_at` IS NULL
AND `category`.`cattype` = 2
ORDER BY `transaction`.`trdate` ASC