app/Models/TrModel.php

SELECT *
FROM `transaction`
---
    public function getAllTrs(){
		$db = db_connect();
		$builder = $db->table('transaction');
		$builder->select('*');
		$records = $builder->get();