app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `username` = 'admin'
AND `password` = '123'
AND `isdeleted` = 0
---
	public function signin($data){
		$session = \Config\Services::session();
		$db = db_connect();
		$un = $data['txtusername'];
		$pw = $data['txtpassword'];

		$builder = $db->table('user');
		$builder->select('*');
		$builder->where('username',$un);
		$builder->where('password',$pw);
        $builder->where('isdeleted',0);

		$records = $builder->countAllResults();